** Objective **

* Clean the tb file
* Confirms the total tuberculosis cases per Country, year, Sex
* Sex and Age are shown as columns. E.g. m04 -> Male between 0-4 yrs, m514 -> Male between 5-14yrs

In [1]:
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('../Exercise Files/chapter2/02_05/tb.csv')
data.head()

,country,year,m04,m514,m014,m1524,m2534,m3544,m4554,m5564,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
# Getting the list of  columns
print(data.columns)
short = data[['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544', 'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534', 'f3544', 'f4554', 'f5564', 'f65', 'fu']]

Index(['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
      dtype='object')

In [4]:
smelt = short.melt(['country', 'year'], ['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544', 'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534', 'f3544', 'f4554', 'f5564', 'f65'], 'sex_age', 'confirmed_cases')
smelt.head()

  country  year sex_age  confirmed_cases
0      AD  1989     m04              NaN
1      AD  1990     m04              NaN
2      AD  1991     m04              NaN
3      AD  1992     m04              NaN
4      AD  1993     m04              NaN

In [5]:
smelt['Age'] = smelt.sex_age.str.split(r"m|f", expand=True)[1]
smelt['Sex'] = smelt.sex_age.str.split(r"\d+", expand=True)[0]
smelt = smelt.rename(columns={'confirmed_cases': 'cases'})
smelt.head()

  country  year sex_age  cases Age Sex
0      AD  1989     m04    NaN  04   m
1      AD  1990     m04    NaN  04   m
2      AD  1991     m04    NaN  04   m
3      AD  1992     m04    NaN  04   m
4      AD  1993     m04    NaN  04   m

In [6]:
smelt_nona = smelt.dropna()
sm)
smelt_nsort_values(['country','year','Age'], inplace=True)

/Users/jayshah/.virtualenvs/venv/lib/python3.9/site-packages/pandas/util/_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)

In [7]:
smelt_nona.head()

      country  year sex_age  cases   Age Sex
11544      AD  1996    m014    0.0   014   m
69234      AD  1996    f014    0.0   014   f
17313      AD  1996   m1524    0.0  1524   m
75003      AD  1996   f1524    1.0  1524   f
23082      AD  1996   m2534    0.0  2534   m

In [8]:
def extract_age_group(age):
    if len(age) == 3:
        return age[0] + '-' + age[1:]
    elif age == 'fu':
        return np.nan
    elif len(age) == 2:
        return age + '+'
    else:
        return age[:2] + '-' + age[2:]

In [9]:
smelt_nona['Age'] = smelt_nona['Age'].apply(lambda s : extract_age_group(s))
smelt_nona.head()

/var/folders/d5/l538v9qn7pz3xsfvbwlgdhtc0000gn/T/ipykernel_1812/397673274.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  smelt_nona['Age'] = smelt_nona['Age'].apply(lambda s : extract_age_group(s))

      country  year sex_age  cases    Age Sex
11544      AD  1996    m014    0.0   0-14   m
69234      AD  1996    f014    0.0   0-14   f
17313      AD  1996   m1524    0.0  15-24   m
75003      AD  1996   f1524    1.0  15-24   f
23082      AD  1996   m2534    0.0  25-34   m

In [10]:
smelt_nona.drop('sex_age', axis=1, inplace=True)
smelt_nona = smelt_nona[['country', 'year','Age','Sex','cases']]
smelt_nona.head()

/Users/jayshah/.virtualenvs/venv/lib/python3.9/site-packages/pandas/core/frame.py:4901: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

      country  year    Age Sex  cases
11544      AD  1996   0-14   m    0.0
69234      AD  1996   0-14   f    0.0
17313      AD  1996  15-24   m    0.0
75003      AD  1996  15-24   f    1.0
23082      AD  1996  25-34   m    0.0

In [11]:
smelt_nona.index.name = 'index'

In [12]:
smelt_nona.reset_index(inplace=True)

In [13]:
smelt_nona.head()

   index country  year    Age Sex  cases
0  11544      AD  1996   0-14   m    0.0
1  69234      AD  1996   0-14   f    0.0
2  17313      AD  1996  15-24   m    0.0
3  75003      AD  1996  15-24   f    1.0
4  23082      AD  1996  25-34   m    0.0